app/controllers/posts_controller.rb

  def index
    @posts = Post.all
    @departments = Department.all
---
SELECT "posts".* FROM "posts"
SELECT "departments".* FROM "departments"

  def show
    @departments = Department.all
    @post = Post.find(params[:id])
---
SELECT "departments".* FROM "departments"
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "5"]]

  def new
@departments = Department.all
---
SELECT "departments".* FROM "departments"

  def edit
  @departments = Department.all
    @post = Post.find(params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "6"]]

  def create
  @departments = Department.all
    @post = current_user.posts.new(params[:post])

    respond_to do |format|
      if @post.save
---
SELECT "departments".* FROM "departments"
INSERT INTO "posts" ("content", "created_at", "dep", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["content", "sdfsdf"], ["created_at", Tue, 10 Dec 2013 06:52:44 UTC +00:00], ["dep", "Department3"], ["title", "sdfdsf"], ["updated_at", Tue, 10 Dec 2013 06:52:44 UTC +00:00], ["user_id", 1]]

  def update
  @departments = Department.all
    @post = Post.find(params[:id])


    respond_to do |format|
      if @post.update_attributes(params[:post])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "5"]]
UPDATE "posts" SET "content" = 'dsa wqe qwe1', "updated_at" = '2012-03-05 19:34:55.066096' WHERE "posts"."id" = 5